In [2]:
%matplotlib inline
import pandas as pd

In [5]:
titles = pd.read_csv('C:/Users/psing/Box/LetsUpgrade AI-ML/Day 16 - 17/Assignment Day 16 - 17/Dataset for Pandas Assinment/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [6]:
len(titles)

244914

### How many movies are listed in the titles dataframe?

In [7]:
len(titles)

244914

In [8]:
titles.shape[0]

244914

### What are the earliest two films listed in the titles dataframe?

In [9]:
earlier_movie=titles.sort_values(by=['year'])

In [10]:
earlier_movie.head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [13]:
titles.loc[titles['title'] == "Hamlet"].count()

title    20
year     20
dtype: int64

### How many movies are titled "North by Northwest"?

In [14]:
titles.loc[titles['title'] == "North by Northwest"].count()

title    1
year     1
dtype: int64

### When was the first movie titled "Hamlet" made?

In [18]:
print (titles[titles['title'] == "Hamlet"].sort_values(by='year').head(1))

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [23]:
movies=titles[titles['title'] == "Treasure Island"].sort_values(by='year')
movies

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [29]:
titles[titles['year'] == 1950].count()

title    1113
year     1113
dtype: int64

### How many movies were made in the year 1960?

In [31]:
print ("count of movies made in 1960 are ",titles[titles['year'] == 1960]['title'].count())

count of movies made in 1960 are  1549

### How many movies were made from 1950 through 1959?

In [37]:
a=titles[(titles['year'] >= 1950) & (titles['year'] <= 1959) ].count()
print("movies were made from 1950 through 1959 are ",a[0])

movies were made from 1950 through 1959 are  12934

### In what years has a movie titled "Batman" been released?

In [38]:
titles.loc[titles['title'] == "Batman"].head()

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [40]:
cast = pd.read_csv('C:/Users/psing/Box/LetsUpgrade AI-ML/Day 16 - 17/Assignment Data Set Day 16 - 17/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [44]:
cast.loc[cast['title']=='Inception']['title'].count()

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [45]:
cast.loc[cast['title']=='Inception']['n'].isna().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [47]:
cast.loc[cast['title']=='Inception']['n'].notnull().sum()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [71]:
no_n=cast.loc[cast['n'].notnull()]
nbn=no_n[no_n['title']=='North by Northwest'][['name','n']]
nbn.sort_values(by='n')

                         name     n
871426             Cary Grant   1.0
3518333       Eva Marie Saint   2.0
1457165           James Mason   3.0
3157232   Jessie Royce Landis   4.0
356707         Leo G. Carroll   5.0
3048272  Josephine Hutchinson   6.0
1695173           Philip Ober   7.0
1275337         Martin Landau   8.0
2447081         Adam Williams   9.0
1811387          Edward Platt  10.0
665768      Robert Ellenstein  11.0
2295714          Les Tremayne  12.0
464736        Philip Coolidge  13.0
1508344         Patrick McVey  14.0
206471           Edward Binns  15.0
1384780             Ken Lynch  16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [74]:
Sleuth=no_n[(no_n['title']=='Sleuth') & (no_n['year']==1972)][['name','n']]
Sleuth.sort_values(by='n')

                       name    n
1705394    Laurence Olivier  1.0
326773        Michael Caine  2.0
373876       Alec Cawthorne  3.0
1465483  John (II) Matthews  4.0
2724553  Eve (III) Channing  5.0
1448690        Teddy Martin  6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [75]:
Sleuth=no_n[(no_n['title']=='Sleuth') & (no_n['year']==2007)][['name','n']]
Sleuth.sort_values(by='n')

                  name    n
326774   Michael Caine  1.0
1293634       Jude Law  2.0
1805907  Harold Pinter  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [76]:
Hamlet=cast.loc[(cast['title']=='Hamlet') & (cast['year']==1921)]
Hamlet['character'].count()

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [78]:
Branagh=cast.loc[(cast['title']=='Hamlet') & (cast['year']==1996)]
Branagh['character'].count()

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [79]:
Hamlet=cast.loc[cast['title']=='Hamlet']
Hamlet['character'].count()

342

### How many people have played an "Ophelia"?

In [92]:
cast[cast['character'] == 'Ophelia']['name'].count()

117

### How many people have played a role called "The Dude"?

In [85]:
cast[cast['character']=='The Dude']['name'].count()

19

### How many people have played a role called "The Stranger"?

In [84]:
cast[cast['character']=='The Stranger']['name'].count()

212

### How many roles has Sidney Poitier played throughout his career?

In [91]:
cast[cast['name'] == "Sidney Poitier"]['character'].count()

43

### How many roles has Judi Dench played?

In [93]:
cast[cast['name'] == "Judi Dench"]['character'].count()

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [129]:
x=cast[(cast['name'] == "Cary Grant") & (cast['n']==2) & (cast['year']==1940)]
x.sort_values(by='year')

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [99]:
cast[(cast['name'] == "Cary Grant")&(cast['year'] == 1940)].sort_values(by = ['year'])

,title,year,name,type,character,n
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871423,My Favorite Wife,1940,Cary Grant,actor,Nick Arden,2.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

### How many roles were available for actors in the 1950s?

In [106]:
cast[(cast['year'] == 1950) & (cast['type'] == 'actor')]['character'].count()

16760

### How many roles were available for actresses in the 1950s?

In [107]:
cast[(cast['year'] == 1950) & (cast['type'] == 'actress')]['character'].count()

5637

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [112]:
cast[(cast['year'] <= 1980) & (cast['n'] == 1)]['character'].count()

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [115]:
cast[(cast['year'] <= 1980) & (cast['n'] > 1)]['character'].count()

669320

Note # Not sure what you mean by non-leading role. as i above leading role n=1 so i used greater than one because if i use smaller then result was zero

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [125]:
c=cast[cast['year'] <= 1980]['n']
c.isnull().sum()

448347